import pandas as pd

data1 = {
    'Набор А': [85, 90, 95, 100, 105],
    'Набор Б': [70, 80, 95, 110, 120],
}

df1 = pd.DataFrame(data1)

stdA = df1['Набор А'].std()
stdB = df1['Набор Б'].std()

print(f"Стандартное отклонение 1 набор - {stdA}")
print(f"Стандартное отклонение 2 набор - {stdB}")

data2 = {
    'Возраст': [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
    'Зарплата': [54000, 58000, 60000, 52000, 55000, 59000, 51000, 49000, 53000, 61000],
}

df2 = pd.DataFrame(data2)

print(df2.describe())
print(f"Средний возраст - {df2['Возраст'].mean()}")
print(f"Медианный возраст - {df2['Возраст'].median()}")
print(f"Стандартное отклонение возраста - {df2['Возраст'].std()}")
print(f"Средняя зарплата - {df2['Зарплата'].mean()}")
print(f"Медианная зп - {df2['Зарплата'].median()}")
print(f"Стандартное отклонение зп - {df2['Зарплата'].std()}")